Revit 2026 API

# JoinGeometryUtilsGetJoinedElements Method

---

Returns all elements joined to given element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> GetJoinedElements(
	Document document,
	Element element
)
```
```vb
Public Shared Function GetJoinedElements (
	document As Document,
	element As Element
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ GetJoinedElements(
	Document^ document,
	Element^ element
)
```
```fsharp
static member GetJoinedElements :
        document : Document *
        element : Element -> ICollection<ElementId>
```

#### Parameters

document Document
     The document containing the element.
element Element
     The element.

#### Return Value

ICollectionElementId The set of elements that are joined to the given element.

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. -or- The element element was not found in the given document. |
| ArgumentNullException | A non-optional argument was null |

This functionality is not available for family documents.

#### Reference

JoinGeometryUtils Class

Autodesk.Revit.DB Namespace